app/controllers/offices_controller.rb

  def index
    if params[:sort] == "num_of_trails"
      @offices = Office.order_by_number_of_trails
---
SELECT "offices".* FROM "offices"