app/controllers/parks_controller.rb

SELECT "parks".* FROM "parks"
---
  def index
    @parks = Park.order_created_at