app/controllers/trails_controller.rb

SELECT "trails".* FROM "trails"
---
  def index
    @trails = Trail.all.true_dogs_allowed